public_html/blogs.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Common Lisp на практике</a></li>
<li><a href="#unnumbered-2">Устройство ASDF (linkfly)</a></li>
<li><a href="#unnumbered-3">Скоро</a></li>
</ul>
</div>
</div>
<h1>Блог</h1>
<order>3</order>

<p>
-*- mode: org; fill-column: 95 -*-
@title Материалы по использованию Common Lisp
</p>

<p>
Здесь размещены тексты других лисперов, показавшиеся мне достаточно важными, чтобы на всякий
случай продублировать их. Разумеется, со ссылками на первоисточник, где могут быть ценные
комментарии.
</p>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Common Lisp на практике</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
@make-list-by-category ★ red cl @
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Устройство ASDF (linkfly)</h2>
<div class="outline-text-2" id="text-unnumbered-2">
<p>
Исходный текст и комментарии: &lt;a href="<a href="http://linkfly.livejournal.com/5582.html">http://linkfly.livejournal.com/5582.html</a>"&gt;<a href="http://linkfly.livejournal.com/5582.html">http://linkfly.livejournal.com/5582.html</a>&lt;/a&gt;
</p>

<p>
@make-list-by-category ★ green asdf @
</p>
</div>
</heading>

<heading id="outline-container-unnumbered-3" class="outline-2">
<h2 id="unnumbered-3">Скоро</h2>
<div class="outline-text-2" id="text-unnumbered-3">
<p>
&lt;ul&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема определения. UNION-OF-DEPENDENCIES&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. OPERATE&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. Подсистема планирования операций. TRAVERSE&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. Подсистема планирования операций. DO-TRAVERSE&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. Подсистема планирования операций. DO-DEP&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. MAKE-SUB-OPERATION&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. PERFORM-PLAN и PERFORM-WITH-RESTART&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. Подсистема выполнения операций. PERFORM&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема загрузки. FIND-COMPONENT&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема поиска. FIND-SYSTEM&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема поиска. COMPUTE-SOURCE-REGISTRY&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема поиска. RESOLVE-LOCATIO&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема определения путей. INPUT-FILES, OUTPUT-FILES и COMPONENT-PATHNAME&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема определения путей. APPLY-OUTPUT-TRANSLATIONS&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Подсистема определения путей. COMPUTE-OUTPUT-TRANSLATIONS&lt;/li&gt;
&lt;li&gt; &lt;span style="color: green"&gt;★&lt;/span&gt; Эпилог&lt;/li&gt;
&lt;/ul&gt;
</p>
</div>
</heading>
